; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-40)
(:domain gripper-strips)
(:objects rooma roomb room3 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 ball27 ball28 ball29 ball30 ball31 ball32 ball33 ball34 ball35 ball36 ball37 ball38 ball39 ball40 )
(:init
(room rooma)
(room roomb)
(room room3)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(ball ball23)
(ball ball24)
(ball ball25)
(ball ball26)
(ball ball27)
(ball ball28)
(ball ball29)
(ball ball30)
(ball ball31)
(ball ball32)
(ball ball33)
(ball ball34)
(ball ball35)
(ball ball36)
(ball ball37)
(ball ball38)
(ball ball39)
(ball ball40)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 rooma)
(at ball10 rooma)
(at ball11 rooma)
(at ball12 rooma)
(at ball13 rooma)
(at ball14 rooma)
(at ball15 rooma)
(at ball16 rooma)
(at ball17 roomb)
(at ball18 roomb)
(at ball19 roomb)
(at ball20 roomb)
(at ball21 roomb)
(at ball22 roomb)
(at ball23 roomb)
(at ball24 roomb)
(at ball25 roomb)
(at ball26 roomb)
(at ball27 roomb)
(at ball28 roomb)
(at ball29 roomb)
(at ball30 roomb)
(at ball31 roomb)
(at ball32 roomb)
(at ball33 room3)
(at ball34 room3)
(at ball35 room3)
(at ball36 room3)
(at ball37 room3)
(at ball38 room3)
(at ball39 room3)
(at ball40 room3)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 rooma)
(at ball10 rooma)
(at ball11 rooma)
(at ball12 roomb)
(at ball13 roomb)
(at ball14 roomb)
(at ball15 roomb)
(at ball16 roomb)
(at ball17 roomb)
(at ball18 roomb)
(at ball19 roomb)
(at ball20 roomb)
(at ball21 roomb)
(at ball22 roomb)
(at ball23 roomb)
(at ball24 roomb)
(at ball25 roomb)
(at ball26 roomb)
(at ball27 roomb)
(at ball28 room3)
(at ball29 room3)
(at ball30 room3)
(at ball31 room3)
(at ball32 room3)
(at ball33 room3)
(at ball34 room3)
(at ball35 room3)
(at ball36 room3)
(at ball37 room3)
(at ball38 room3)
(at ball39 room3)
(at ball40 room3)
)
)
)

; plan
1. (pick ball16 rooma left)
   deleted: (at ball16 rooma) (free left)
   added: (carry ball16 left)
   goals met: 30 of 40
2. (pick ball15 rooma right)
   deleted: (at ball15 rooma) (free right)
   added: (carry ball15 right)
   goals met: 30 of 40
3. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 30 of 40
4. (drop ball15 roomb right)
   deleted: (carry ball15 right)
   added: (at ball15 roomb) (free right)
   goals met: 31 of 40
5. (drop ball16 roomb left)
   deleted: (carry ball16 left)
   added: (at ball16 roomb) (free left)
   goals met: 32 of 40
6. (pick ball32 roomb left)
   deleted: (at ball32 roomb) (free left)
   added: (carry ball32 left)
   goals met: 32 of 40
7. (pick ball31 roomb right)
   deleted: (at ball31 roomb) (free right)
   added: (carry ball31 right)
   goals met: 32 of 40
8. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 32 of 40
9. (drop ball31 room3 right)
   deleted: (carry ball31 right)
   added: (at ball31 room3) (free right)
   goals met: 33 of 40
10. (drop ball32 room3 left)
   deleted: (carry ball32 left)
   added: (at ball32 room3) (free left)
   goals met: 34 of 40
11. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 34 of 40
12. (pick ball30 roomb left)
   deleted: (at ball30 roomb) (free left)
   added: (carry ball30 left)
   goals met: 34 of 40
13. (pick ball29 roomb right)
   deleted: (at ball29 roomb) (free right)
   added: (carry ball29 right)
   goals met: 34 of 40
14. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 34 of 40
15. (drop ball29 room3 right)
   deleted: (carry ball29 right)
   added: (at ball29 room3) (free right)
   goals met: 35 of 40
16. (drop ball30 room3 left)
   deleted: (carry ball30 left)
   added: (at ball30 room3) (free left)
   goals met: 36 of 40
17. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 36 of 40
18. (pick ball28 roomb left)
   deleted: (at ball28 roomb) (free left)
   added: (carry ball28 left)
   goals met: 36 of 40
19. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 36 of 40
20. (drop ball28 room3 left)
   deleted: (carry ball28 left)
   added: (at ball28 room3) (free left)
   goals met: 37 of 40
21. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 37 of 40
22. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 37 of 40
23. (pick ball14 rooma left)
   deleted: (at ball14 rooma) (free left)
   added: (carry ball14 left)
   goals met: 37 of 40
24. (pick ball13 rooma right)
   deleted: (at ball13 rooma) (free right)
   added: (carry ball13 right)
   goals met: 37 of 40
25. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 37 of 40
26. (drop ball13 roomb right)
   deleted: (carry ball13 right)
   added: (at ball13 roomb) (free right)
   goals met: 38 of 40
27. (drop ball14 roomb left)
   deleted: (carry ball14 left)
   added: (at ball14 roomb) (free left)
   goals met: 39 of 40
28. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 39 of 40
29. (pick ball12 rooma left)
   deleted: (at ball12 rooma) (free left)
   added: (carry ball12 left)
   goals met: 39 of 40
30. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 39 of 40
31. (drop ball12 roomb left)
   deleted: (carry ball12 left)
   added: (at ball12 roomb) (free left)
   goals met: 40 of 40
